app/views/page/_issue_list.html.erb

SELECT COUNT(*) FROM `comments`  WHERE `comments`.`issue_id` = 5
---
        <i class="fa fa-comments"></i>
        <%= link_to i.comments.count, i	%>