app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `created_at`, `email`, `issue_id`, `updated_at`, `username`) VALUES ('hi aaa', '2015-06-21 18:56:04', 'aa@aa.com', 2, '2015-06-21 18:56:04', 'aa')
---
	def create
  	@comment = Comment.new(comment_params)
		@comment.save

SELECT  `comments`.* FROM `comments`  WHERE `comments`.`id` = 13 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 13
---
	def destroy
  	comment = Comment.find(params[:id])
  	@issue=comment.issue
  	comment.destroy