app/controllers/issues_controller.rb

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
---
  def show
  	@issue=Issue.find(params[:id])

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
DELETE FROM `issues` WHERE `issues`.`id` = 1
---
	def destroy
  	issue = Issue.find(params[:id])
  	issue.destroy

INSERT INTO `issues` (`content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('sfdfgdfgdg', '2015-06-22 19:44:11', 'haha', '2015-06-22 19:44:11', 5)
---
	def create
  	Issue.create(issue_params)

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
---
	def edit
  	@issue = Issue.find(params[:id])

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
UPDATE `issues` SET `content` = 'this is ss，^_^', `updated_at` = '2015-06-21 17:09:45' WHERE `issues`.`id` = 2
---
  def update
    i = Issue.find(params[:id])
    i.update_attributes(issue_params)