app/controllers/places_controller.rb

	def index
		@places= Place.all
---
SELECT `places`.* FROM `places`

	def show
		@place= Place.find(params[:id])
---
SELECT  `places`.* FROM `places`  WHERE `places`.`id` = 1 LIMIT 1

	def create
		Place.create(place_params)
---
INSERT INTO `places` (`address`, `capacity`, `created_at`, `description`, `name`, `owner`, `updated_at`) VALUES ('CASE RD', 5000, '2015-06-23 18:11:11', 'good ', 'CASE', 'CASE', '2015-06-23 18:11:11')

	def destroy
  	place = Place.find(params[:id])
  	place.destroy
---
SELECT  `places`.* FROM `places`  WHERE `places`.`id` = 2 LIMIT 1
DELETE FROM `places` WHERE `places`.`id` = 2

	def edit
  	@place = Place.find(params[:id])
---
SELECT  `places`.* FROM `places`  WHERE `places`.`id` = 3 LIMIT 1

	def update
    place = Place.find(params[:id])
    place.update_attributes(place_params)
---
SELECT  `places`.* FROM `places`  WHERE `places`.`id` = 3 LIMIT 1
UPDATE `places` SET `description` = 'xxXX', `updated_at` = '2015-06-23 18:25:56' WHERE `places`.`id` = 3