app/controllers/users_controller.rb

INSERT INTO `users` (`auth_token`, `created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('i7d4iZ4zkg4W46eFczMG-A', '2015-06-22 14:06:35', 'aa', 'aa', '$2a$10$QtCUFY2Pw7OU1E/ck1bT7.ttH2Bi8ipVjZXZXUPzrTCcHqfTx6g0i', '2015-06-22 14:06:35')
---
  def create
  	@user=User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users`  WHERE `users`.`name` = 'bb' LIMIT 1
---
  def create_login_session
    user = User.find_by_name(params[:name])